==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
GeneralMLP                               [128, 964]                --
├─Sequential: 1-1                        [128, 784]                --
│    └─Linear: 2-1                       [128, 784]                614,656
│    └─Tanh: 2-2                         [128, 784]                --
│    └─Linear: 2-3                       [128, 784]                614,656
│    └─Tanh: 2-4                         [128, 784]                --
├─Linear: 1-2                            [128, 964]                755,776
==========================================================================================
Total params: 1,985,088
Trainable params: 1,985,088
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 254.09
==========================================================================================
Input size (MB): 0.40
Forward/backward pass size (MB): 2.59
Params size (MB): 7.94
Estimated Total Size (MB): 10.93
==========================================================================================

Evaluator Hook Layer: features.2
