==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
GeneralMLP                               [128, 10]                 --
├─Sequential: 1-1                        [128, 128]                --
│    └─Linear: 2-1                       [128, 128]                100,352
│    └─Tanh: 2-2                         [128, 128]                --
│    └─Linear: 2-3                       [128, 128]                16,384
│    └─Tanh: 2-4                         [128, 128]                --
├─Linear: 1-2                            [128, 10]                 1,280
==========================================================================================
Total params: 118,016
Trainable params: 118,016
Non-trainable params: 0
Total mult-adds (Units.MEGABYTES): 15.11
==========================================================================================
Input size (MB): 0.40
Forward/backward pass size (MB): 0.27
Params size (MB): 0.47
Estimated Total Size (MB): 1.15
==========================================================================================