==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
ResearchCNN                              [128, 964]                --
├─Sequential: 1-1                        [128, 128, 7, 7]          --
│    └─Conv2d: 2-1                       [128, 32, 28, 28]         288
│    └─Tanh: 2-2                         [128, 32, 28, 28]         --
│    └─MaxPool2d: 2-3                    [128, 32, 14, 14]         --
│    └─Conv2d: 2-4                       [128, 64, 14, 14]         18,432
│    └─Tanh: 2-5                         [128, 64, 14, 14]         --
│    └─MaxPool2d: 2-6                    [128, 64, 7, 7]           --
│    └─Conv2d: 2-7                       [128, 128, 7, 7]          73,728
│    └─Tanh: 2-8                         [128, 128, 7, 7]          --
├─Dropout: 1-2                           [128, 6272]               --
├─Linear: 1-3                            [128, 964]                6,046,208
==========================================================================================
Total params: 6,138,656
Trainable params: 6,138,656
Non-trainable params: 0
Total mult-adds (Units.GIGABYTES): 1.73
==========================================================================================
Input size (MB): 0.40
Forward/backward pass size (MB): 45.94
Params size (MB): 24.55
Estimated Total Size (MB): 70.90
==========================================================================================